Revit 2027 API
View3D.ProjectGridsOnSectionBox Property
 This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ProjectGridsOnSectionBox { get; set; }
Public Property ProjectGridsOnSectionBox As Boolean
	Get
	Set
public:
property bool ProjectGridsOnSectionBox {
	bool get ();
	void set (bool value);
}
member ProjectGridsOnSectionBox : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace